УТ_для_edt/src/Catalogs/смартПравилаДанныхКонструктора/смартПравилаДанныхКонструктора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартПравилаДанныхКонструктора</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НазначениеДанных</name>
    <type>
      <types>CatalogRef.смартНазначениеДанныхКонструктора</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.смартВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартПравилаДанныхКонструктора/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//МассивПолей = Новый Массив;
	//МассивПолей.Добавить("НазначениеДанных");
	//МассивПолей.Добавить("ВидОборудования");
	//МассивПолей.Добавить("НомерПоПорядку");
	//МассивПолей.Добавить("Значение");
	//МассивПолей.Добавить("Использовать");
	//МассивПолей.Добавить("Комментарий");
	//МассивПолей.Добавить("ПометкаУдаления");
	//МассивПолей.Добавить("Предопределенный");
	//МассивПолей.Добавить("Ссылка");
	//
	//Список.УстановитьОграниченияИспользованияВПорядке(МассивПолей);
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПереместитьНаСервере(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПереместитьНаСервере(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура УпорядочитьВидОборудованияПоАлфавиту(Команда)
	
	УпорядочитьВесьСписокСервер("ВидОборудования", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УпорядочитьНазначениеПоАлфавиту(Команда)
	
	УпорядочитьВесьСписокСервер("НазначениеДанных", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ПереместитьНаСервере(Шаг)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартПравилаДанныхКонструктора.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартПравилаДанныхКонструктора КАК смартПравилаДанныхКонструктора
	|ГДЕ
	|	смартПравилаДанныхКонструктора.НазначениеДанных = &НазначениеДанных
	|	И смартПравилаДанныхКонструктора.ВидОборудования = &ВидОборудования
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартПравилаДанныхКонструктора.НомерПоПорядку";
	
	Запрос.УстановитьПараметр("НазначениеДанных", Элементы.Список.ТекущаяСтрока.НазначениеДанных);
	Запрос.УстановитьПараметр("ВидОборудования", Элементы.Список.ТекущаяСтрока.ВидОборудования);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	СтрокаТекущегоЭлемента = ТЗ.Найти(Элементы.Список.ТекущаяСтрока);
	ИндексТекущейСтроки = ТЗ.Индекс(СтрокаТекущегоЭлемента);
	ИндексЗаменяемойСтроки = ИндексТекущейСтроки + Шаг;
	
	Если ТЗ.Количество() - 1 >= ИндексЗаменяемойСтроки И ИндексЗаменяемойСтроки >=0 Тогда
		
		СтрокаОбмена = ТЗ[ИндексЗаменяемойСтроки];
		
		ТекущийОбъект = СтрокаТекущегоЭлемента.Ссылка.ПолучитьОбъект();
		ОбъектОбмена = СтрокаОбмена.Ссылка.ПолучитьОбъект();
		
		ТекущийОбъект.НомерПоПорядку = ТекущийОбъект.НомерПоПорядку + ОбъектОбмена.НомерПоПорядку;
		ОбъектОбмена.НомерПоПорядку = ТекущийОбъект.НомерПоПорядку - ОбъектОбмена.НомерПоПорядку;
		ТекущийОбъект.НомерПоПорядку = ТекущийОбъект.НомерПоПорядку - ОбъектОбмена.НомерПоПорядку;
		
		ТекущийОбъект.ОбменДанными.Загрузка = Истина;
		ТекущийОбъект.Записать();
			
		ОбъектОбмена.ОбменДанными.Загрузка = Истина;
		ОбъектОбмена.Записать();
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УпорядочитьВесьСписокСервер(ИмяРеквизита, ПоВозрастанию)
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
	"ВЫБРАТЬ
	|	смартПравилаДанныхКонструктора.Ссылка КАК Ссылка,
	|	смартПравилаДанныхКонструктора.НомерПоПорядку КАК НомерПоПорядку,
	|	смартПравилаДанныхКонструктора.НазначениеДанных КАК НазначениеДанных,
	|	смартПравилаДанныхКонструктора.ВидОборудования КАК ВидОборудования
	|ИЗ
	|	Справочник.смартПравилаДанныхКонструктора КАК смартПравилаДанныхКонструктора
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартПравилаДанныхКонструктора.%1.Наименование %2
	|ИТОГИ ПО
	|	ВидОборудования,
	|	НазначениеДанных", ИмяРеквизита, ?(ПоВозрастанию, "ВОЗР", "УБЫВ"));
	
	ВыборкаНазначение = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаНазначение.Следующий() Цикл
		
		ВыборкаВидОборудования = ВыборкаНазначение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаВидОборудования.Следующий() Цикл
	
			Счетчик = 0;
			Выборка = ВыборкаВидОборудования.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Счетчик = Счетчик + 1;
				Если Выборка.НомерПоПорядку <> Счетчик Тогда
					
					ТекОбъект = Выборка.Ссылка.ПолучитьОбъект();
					ТекОбъект.НомерПоПорядку = Счетчик;
					ТекОбъект.ОбменДанными.Загрузка = Истина;
					ТекОбъект.Записать();
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
